dwynnychuk/SmartSmoker/ESP32Code/lib/LSM6DS/lsm6dsr_reg.h
int32_t lsm6dsr_fifo_out_raw_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_odr_cal_reg_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_odr_cal_reg_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_number_of_steps_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_steps_reset(lsm6dsr_ctx_t *ctx);

typedef enum {
  LSM6DSR_USER_BANK           = 0,
  LSM6DSR_SENSOR_HUB_BANK     = 1,
  LSM6DSR_EMBEDDED_FUNC_BANK  = 2,
} lsm6dsr_reg_access_t;
int32_t lsm6dsr_mem_bank_set(lsm6dsr_ctx_t *ctx, lsm6dsr_reg_access_t val);
int32_t lsm6dsr_mem_bank_get(lsm6dsr_ctx_t *ctx, lsm6dsr_reg_access_t *val);

int32_t lsm6dsr_ln_pg_write_byte(lsm6dsr_ctx_t *ctx, uint16_t address,
                                 uint8_t *val);
int32_t lsm6dsr_ln_pg_write(lsm6dsr_ctx_t *ctx, uint16_t address,
                            uint8_t *buf, uint8_t len);
int32_t lsm6dsr_ln_pg_read_byte(lsm6dsr_ctx_t *ctx, uint16_t add,
                                uint8_t *val);
int32_t lsm6dsr_ln_pg_read(lsm6dsr_ctx_t *ctx, uint16_t address, uint8_t *val);

typedef enum {
  LSM6DSR_DRDY_LATCHED = 0,
  LSM6DSR_DRDY_PULSED  = 1,
} lsm6dsr_dataready_pulsed_t;
int32_t lsm6dsr_data_ready_mode_set(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_dataready_pulsed_t val);
int32_t lsm6dsr_data_ready_mode_get(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_dataready_pulsed_t *val);

int32_t lsm6dsr_device_id_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_reset_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_reset_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_auto_increment_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_auto_increment_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_boot_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_boot_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_XL_ST_DISABLE  = 0,
  LSM6DSR_XL_ST_POSITIVE = 1,
  LSM6DSR_XL_ST_NEGATIVE = 2,
} lsm6dsr_st_xl_t;
int32_t lsm6dsr_xl_self_test_set(lsm6dsr_ctx_t *ctx, lsm6dsr_st_xl_t val);
int32_t lsm6dsr_xl_self_test_get(lsm6dsr_ctx_t *ctx, lsm6dsr_st_xl_t *val);

typedef enum {
  LSM6DSR_GY_ST_DISABLE  = 0,
  LSM6DSR_GY_ST_POSITIVE = 1,
  LSM6DSR_GY_ST_NEGATIVE = 3,
} lsm6dsr_st_g_t;
int32_t lsm6dsr_gy_self_test_set(lsm6dsr_ctx_t *ctx, lsm6dsr_st_g_t val);
int32_t lsm6dsr_gy_self_test_get(lsm6dsr_ctx_t *ctx, lsm6dsr_st_g_t *val);

int32_t lsm6dsr_xl_filter_lp2_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_xl_filter_lp2_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_gy_filter_lp1_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_gy_filter_lp1_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_filter_settling_mask_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_filter_settling_mask_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_ULTRA_LIGHT  = 0,
  LSM6DSR_VERY_LIGHT   = 1,
  LSM6DSR_LIGHT        = 2,
  LSM6DSR_MEDIUM       = 3,
  LSM6DSR_STRONG       = 4,
  LSM6DSR_VERY_STRONG  = 5,
  LSM6DSR_AGGRESSIVE   = 6,
  LSM6DSR_XTREME       = 7,
} lsm6dsr_ftype_t;
int32_t lsm6dsr_gy_lp1_bandwidth_set(lsm6dsr_ctx_t *ctx, lsm6dsr_ftype_t val);
int32_t lsm6dsr_gy_lp1_bandwidth_get(lsm6dsr_ctx_t *ctx, lsm6dsr_ftype_t *val);

int32_t lsm6dsr_xl_lp2_on_6d_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_xl_lp2_on_6d_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_HP_PATH_DISABLE_ON_OUT    = 0x00,
  LSM6DSR_SLOPE_ODR_DIV_4           = 0x10,
  LSM6DSR_HP_ODR_DIV_10             = 0x11,
  LSM6DSR_HP_ODR_DIV_20             = 0x12,
  LSM6DSR_HP_ODR_DIV_45             = 0x13,
  LSM6DSR_HP_ODR_DIV_100            = 0x14,
  LSM6DSR_HP_ODR_DIV_200            = 0x15,
  LSM6DSR_HP_ODR_DIV_400            = 0x16,
  LSM6DSR_HP_ODR_DIV_800            = 0x17,
  LSM6DSR_HP_REF_MD_ODR_DIV_10      = 0x31,
  LSM6DSR_HP_REF_MD_ODR_DIV_20      = 0x32,
  LSM6DSR_HP_REF_MD_ODR_DIV_45      = 0x33,
  LSM6DSR_HP_REF_MD_ODR_DIV_100     = 0x34,
  LSM6DSR_HP_REF_MD_ODR_DIV_200     = 0x35,
  LSM6DSR_HP_REF_MD_ODR_DIV_400     = 0x36,
  LSM6DSR_HP_REF_MD_ODR_DIV_800     = 0x37,
  LSM6DSR_LP_ODR_DIV_10             = 0x01,
  LSM6DSR_LP_ODR_DIV_20             = 0x02,
  LSM6DSR_LP_ODR_DIV_45             = 0x03,
  LSM6DSR_LP_ODR_DIV_100            = 0x04,
  LSM6DSR_LP_ODR_DIV_200            = 0x05,
  LSM6DSR_LP_ODR_DIV_400            = 0x06,
  LSM6DSR_LP_ODR_DIV_800            = 0x07,
} lsm6dsr_hp_slope_xl_en_t;
int32_t lsm6dsr_xl_hp_path_on_out_set(lsm6dsr_ctx_t *ctx,
                                      lsm6dsr_hp_slope_xl_en_t val);
int32_t lsm6dsr_xl_hp_path_on_out_get(lsm6dsr_ctx_t *ctx,
                                      lsm6dsr_hp_slope_xl_en_t *val);

int32_t lsm6dsr_xl_fast_settling_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_xl_fast_settling_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_USE_SLOPE = 0,
  LSM6DSR_USE_HPF   = 1,
} lsm6dsr_slope_fds_t;
int32_t lsm6dsr_xl_hp_path_internal_set(lsm6dsr_ctx_t *ctx,
                                        lsm6dsr_slope_fds_t val);
int32_t lsm6dsr_xl_hp_path_internal_get(lsm6dsr_ctx_t *ctx,
                                        lsm6dsr_slope_fds_t *val);

typedef enum {
  LSM6DSR_HP_FILTER_NONE     = 0x00,
  LSM6DSR_HP_FILTER_16mHz    = 0x80,
  LSM6DSR_HP_FILTER_65mHz    = 0x81,
  LSM6DSR_HP_FILTER_260mHz   = 0x82,
  LSM6DSR_HP_FILTER_1Hz04    = 0x83,
} lsm6dsr_hpm_g_t;
int32_t lsm6dsr_gy_hp_path_internal_set(lsm6dsr_ctx_t *ctx,
                                        lsm6dsr_hpm_g_t val);
int32_t lsm6dsr_gy_hp_path_internal_get(lsm6dsr_ctx_t *ctx,
                                        lsm6dsr_hpm_g_t *val);

typedef enum {
  LSM6DSR_AUX_PULL_UP_DISC       = 0,
  LSM6DSR_AUX_PULL_UP_CONNECT    = 1,
} lsm6dsr_ois_pu_dis_t;
int32_t lsm6dsr_aux_sdo_ocs_mode_set(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_ois_pu_dis_t val);
int32_t lsm6dsr_aux_sdo_ocs_mode_get(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_ois_pu_dis_t *val);

