dwynnychuk/SmartSmoker/ESP32Code/lib/LSM6DS/lsm6dsr_reg.h
typedef enum {
  LSM6DSR_GYRO_NC_TAG    = 1,
  LSM6DSR_XL_NC_TAG,
  LSM6DSR_TEMPERATURE_TAG,
  LSM6DSR_TIMESTAMP_TAG,
  LSM6DSR_CFG_CHANGE_TAG,
  LSM6DSR_XL_NC_T_2_TAG,
  LSM6DSR_XL_NC_T_1_TAG,
  LSM6DSR_XL_2XC_TAG,
  LSM6DSR_XL_3XC_TAG,
  LSM6DSR_GYRO_NC_T_2_TAG,
  LSM6DSR_GYRO_NC_T_1_TAG,
  LSM6DSR_GYRO_2XC_TAG,
  LSM6DSR_GYRO_3XC_TAG,
  LSM6DSR_SENSORHUB_SLAVE0_TAG,
  LSM6DSR_SENSORHUB_SLAVE1_TAG,
  LSM6DSR_SENSORHUB_SLAVE2_TAG,
  LSM6DSR_SENSORHUB_SLAVE3_TAG,
  LSM6DSR_STEP_CPUNTER_TAG,
  LSM6DSR_GAME_ROTATION_TAG,
  LSM6DSR_GEOMAG_ROTATION_TAG,
  LSM6DSR_ROTATION_TAG,
  LSM6DSR_SENSORHUB_NACK_TAG  = 0x19,
} lsm6dsr_fifo_tag_t;
int32_t lsm6dsr_fifo_sensor_tag_get(lsm6dsr_ctx_t *ctx,
                                    lsm6dsr_fifo_tag_t *val);

int32_t lsm6dsr_fifo_pedo_batch_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_fifo_pedo_batch_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_0_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_batch_slave_0_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_1_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_batch_slave_1_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_2_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_batch_slave_2_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_3_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_batch_slave_3_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_DEN_DISABLE    = 0,
  LSM6DSR_LEVEL_FIFO     = 6,
  LSM6DSR_LEVEL_LETCHED  = 3,
  LSM6DSR_LEVEL_TRIGGER  = 2,
  LSM6DSR_EDGE_TRIGGER   = 4,
} lsm6dsr_den_mode_t;
int32_t lsm6dsr_den_mode_set(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_den_mode_t val);
int32_t lsm6dsr_den_mode_get(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_den_mode_t *val);

typedef enum {
  LSM6DSR_DEN_ACT_LOW  = 0,
  LSM6DSR_DEN_ACT_HIGH = 1,
} lsm6dsr_den_lh_t;
int32_t lsm6dsr_den_polarity_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_den_lh_t val);
int32_t lsm6dsr_den_polarity_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_den_lh_t *val);

typedef enum {
  LSM6DSR_STAMP_IN_GY_DATA     = 0,
  LSM6DSR_STAMP_IN_XL_DATA     = 1,
  LSM6DSR_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dsr_den_xl_g_t;
int32_t lsm6dsr_den_enable_set(lsm6dsr_ctx_t *ctx,
                               lsm6dsr_den_xl_g_t val);
int32_t lsm6dsr_den_enable_get(lsm6dsr_ctx_t *ctx,
                               lsm6dsr_den_xl_g_t *val);

int32_t lsm6dsr_den_mark_axis_x_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_den_mark_axis_x_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_den_mark_axis_y_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_den_mark_axis_y_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_den_mark_axis_z_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_den_mark_axis_z_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_pedo_sens_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_pedo_sens_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_PEDO_BASE                = 0x00,
  LSM6DSR_PEDO_BASE_FALSE_STEP_REJ = 0x01,
  LSM6DSR_PEDO_ADV_FALSE_STEP_REJ  = 0x03,
} lsm6dsr_pedo_mode_t;
int32_t lsm6dsr_pedo_mode_set(lsm6dsr_ctx_t *ctx, lsm6dsr_pedo_mode_t val);
int32_t lsm6dsr_pedo_mode_get(lsm6dsr_ctx_t *ctx, lsm6dsr_pedo_mode_t *val);

int32_t lsm6dsr_pedo_step_detect_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_pedo_debounce_steps_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_pedo_debounce_steps_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_pedo_steps_period_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_pedo_steps_period_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_pedo_adv_detection_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_pedo_adv_detection_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_pedo_false_step_rejection_set(lsm6dsr_ctx_t *ctx,
                                              uint8_t val);
int32_t lsm6dsr_pedo_false_step_rejection_get(lsm6dsr_ctx_t *ctx,
                                              uint8_t *val);

typedef enum {
  LSM6DSR_EVERY_STEP     = 0,
  LSM6DSR_COUNT_OVERFLOW = 1,
} lsm6dsr_carry_count_en_t;
int32_t lsm6dsr_pedo_int_mode_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_carry_count_en_t val);
int32_t lsm6dsr_pedo_int_mode_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_carry_count_en_t *val);

int32_t lsm6dsr_motion_sens_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_motion_sens_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_motion_flag_data_ready_get(lsm6dsr_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsr_tilt_sens_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tilt_sens_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tilt_flag_data_ready_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_mag_sensitivity_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_mag_sensitivity_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_mag_offset_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_mag_offset_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_mag_soft_iron_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_mag_soft_iron_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

typedef enum {
  LSM6DSR_Z_EQ_Y     = 0,
  LSM6DSR_Z_EQ_MIN_Y = 1,
  LSM6DSR_Z_EQ_X     = 2,
  LSM6DSR_Z_EQ_MIN_X = 3,
  LSM6DSR_Z_EQ_MIN_Z = 4,
  LSM6DSR_Z_EQ_Z     = 5,
} lsm6dsr_mag_z_axis_t;
int32_t lsm6dsr_mag_z_orient_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_z_axis_t val);
int32_t lsm6dsr_mag_z_orient_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_z_axis_t *val);

typedef enum {
  LSM6DSR_Y_EQ_Y     = 0,
  LSM6DSR_Y_EQ_MIN_Y = 1,
  LSM6DSR_Y_EQ_X     = 2,
  LSM6DSR_Y_EQ_MIN_X = 3,
  LSM6DSR_Y_EQ_MIN_Z = 4,
  LSM6DSR_Y_EQ_Z     = 5,
} lsm6dsr_mag_y_axis_t;
int32_t lsm6dsr_mag_y_orient_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_y_axis_t val);
int32_t lsm6dsr_mag_y_orient_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_y_axis_t *val);

