dwynnychuk/SmartSmoker/ESP32Code/lib/LSM6DS/lsm6dsr_reg.h
typedef enum {
  LSM6DSR_X_EQ_Y     = 0,
  LSM6DSR_X_EQ_MIN_Y = 1,
  LSM6DSR_X_EQ_X     = 2,
  LSM6DSR_X_EQ_MIN_X = 3,
  LSM6DSR_X_EQ_MIN_Z = 4,
  LSM6DSR_X_EQ_Z     = 5,
} lsm6dsr_mag_x_axis_t;
int32_t lsm6dsr_mag_x_orient_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_x_axis_t val);
int32_t lsm6dsr_mag_x_orient_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_mag_x_axis_t *val);

int32_t lsm6dsr_long_cnt_flag_data_ready_get(lsm6dsr_ctx_t *ctx,
                                             uint8_t *val);

int32_t lsm6dsr_emb_fsm_en_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_emb_fsm_en_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef struct {
    lsm6dsr_fsm_enable_a_t          fsm_enable_a;
    lsm6dsr_fsm_enable_b_t          fsm_enable_b;
} lsm6dsr_emb_fsm_enable_t;
int32_t lsm6dsr_fsm_enable_set(lsm6dsr_ctx_t *ctx,
                               lsm6dsr_emb_fsm_enable_t *val);
int32_t lsm6dsr_fsm_enable_get(lsm6dsr_ctx_t *ctx,
                               lsm6dsr_emb_fsm_enable_t *val);

int32_t lsm6dsr_long_cnt_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_long_cnt_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

typedef enum {
  LSM6DSR_LC_NORMAL     = 0,
  LSM6DSR_LC_CLEAR      = 1,
  LSM6DSR_LC_CLEAR_DONE = 2,
} lsm6dsr_fsm_lc_clr_t;
int32_t lsm6dsr_long_clr_set(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_fsm_lc_clr_t val);
int32_t lsm6dsr_long_clr_get(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_fsm_lc_clr_t *val);

typedef struct {
    lsm6dsr_fsm_outs1_t    fsm_outs1;
    lsm6dsr_fsm_outs2_t    fsm_outs2;
    lsm6dsr_fsm_outs3_t    fsm_outs3;
    lsm6dsr_fsm_outs4_t    fsm_outs4;
    lsm6dsr_fsm_outs5_t    fsm_outs5;
    lsm6dsr_fsm_outs6_t    fsm_outs6;
    lsm6dsr_fsm_outs7_t    fsm_outs7;
    lsm6dsr_fsm_outs8_t    fsm_outs8;
    lsm6dsr_fsm_outs9_t    fsm_outs9;
    lsm6dsr_fsm_outs10_t    fsm_outs10;
    lsm6dsr_fsm_outs11_t    fsm_outs11;
    lsm6dsr_fsm_outs12_t    fsm_outs12;
    lsm6dsr_fsm_outs13_t    fsm_outs13;
    lsm6dsr_fsm_outs14_t    fsm_outs14;
    lsm6dsr_fsm_outs15_t    fsm_outs15;
    lsm6dsr_fsm_outs16_t    fsm_outs16;
} lsm6dsr_fsm_out_t;
int32_t lsm6dsr_fsm_out_get(lsm6dsr_ctx_t *ctx, lsm6dsr_fsm_out_t *val);

typedef enum {
  LSM6DSR_ODR_FSM_12Hz5 = 0,
  LSM6DSR_ODR_FSM_26Hz  = 1,
  LSM6DSR_ODR_FSM_52Hz  = 2,
  LSM6DSR_ODR_FSM_104Hz = 3,
} lsm6dsr_fsm_odr_t;
int32_t lsm6dsr_fsm_data_rate_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_fsm_odr_t val);
int32_t lsm6dsr_fsm_data_rate_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_fsm_odr_t *val);

int32_t lsm6dsr_fsm_init_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_fsm_init_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_long_cnt_int_value_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_long_cnt_int_value_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsr_fsm_number_of_programs_set(lsm6dsr_ctx_t *ctx,
                                           uint8_t *buff);
int32_t lsm6dsr_fsm_number_of_programs_get(lsm6dsr_ctx_t *ctx,
                                           uint8_t *buff);

int32_t lsm6dsr_fsm_start_address_set(lsm6dsr_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsr_fsm_start_address_get(lsm6dsr_ctx_t *ctx, uint8_t *buff);

typedef struct {
    lsm6dsr_sensor_hub_1_t   sh_byte_1;
    lsm6dsr_sensor_hub_2_t   sh_byte_2;
    lsm6dsr_sensor_hub_3_t   sh_byte_3;
    lsm6dsr_sensor_hub_4_t   sh_byte_4;
    lsm6dsr_sensor_hub_5_t   sh_byte_5;
    lsm6dsr_sensor_hub_6_t   sh_byte_6;
    lsm6dsr_sensor_hub_7_t   sh_byte_7;
    lsm6dsr_sensor_hub_8_t   sh_byte_8;
    lsm6dsr_sensor_hub_9_t   sh_byte_9;
    lsm6dsr_sensor_hub_10_t  sh_byte_10;
    lsm6dsr_sensor_hub_11_t  sh_byte_11;
    lsm6dsr_sensor_hub_12_t  sh_byte_12;
    lsm6dsr_sensor_hub_13_t  sh_byte_13;
    lsm6dsr_sensor_hub_14_t  sh_byte_14;
    lsm6dsr_sensor_hub_15_t  sh_byte_15;
    lsm6dsr_sensor_hub_16_t  sh_byte_16;
    lsm6dsr_sensor_hub_17_t  sh_byte_17;
    lsm6dsr_sensor_hub_18_t  sh_byte_18;
} lsm6dsr_emb_sh_read_t;
int32_t lsm6dsr_sh_read_data_raw_get(lsm6dsr_ctx_t *ctx,
                                     lsm6dsr_emb_sh_read_t *val);

typedef enum {
  LSM6DSR_SLV_0       = 0,
  LSM6DSR_SLV_0_1     = 1,
  LSM6DSR_SLV_0_1_2   = 2,
  LSM6DSR_SLV_0_1_2_3 = 3,
} lsm6dsr_aux_sens_on_t;
int32_t lsm6dsr_sh_slave_connected_set(lsm6dsr_ctx_t *ctx,
                                       lsm6dsr_aux_sens_on_t val);
int32_t lsm6dsr_sh_slave_connected_get(lsm6dsr_ctx_t *ctx,
                                       lsm6dsr_aux_sens_on_t *val);

int32_t lsm6dsr_sh_master_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_master_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_EXT_PULL_UP      = 0,
  LSM6DSR_INTERNAL_PULL_UP = 1,
} lsm6dsr_shub_pu_en_t;
int32_t lsm6dsr_sh_pin_mode_set(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_shub_pu_en_t val);
int32_t lsm6dsr_sh_pin_mode_get(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_shub_pu_en_t *val);

int32_t lsm6dsr_sh_pass_through_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_pass_through_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_EXT_ON_INT2_PIN = 0,
  LSM6DSR_XL_GY_DRDY      = 1,
} lsm6dsr_start_config_t;
int32_t lsm6dsr_sh_syncro_mode_set(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_start_config_t val);
int32_t lsm6dsr_sh_syncro_mode_get(lsm6dsr_ctx_t *ctx,
                                   lsm6dsr_start_config_t *val);

typedef enum {
  LSM6DSR_EACH_SH_CYCLE    = 0,
  LSM6DSR_ONLY_FIRST_CYCLE = 1,
} lsm6dsr_write_once_t;
int32_t lsm6dsr_sh_write_mode_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_write_once_t val);
int32_t lsm6dsr_sh_write_mode_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_write_once_t *val);

int32_t lsm6dsr_sh_reset_set(lsm6dsr_ctx_t *ctx);
int32_t lsm6dsr_sh_reset_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSR_SH_ODR_104Hz = 0,
  LSM6DSR_SH_ODR_52Hz  = 1,
  LSM6DSR_SH_ODR_26Hz  = 2,
  LSM6DSR_SH_ODR_13Hz  = 3,
} lsm6dsr_shub_odr_t;
int32_t lsm6dsr_sh_data_rate_set(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_shub_odr_t val);
int32_t lsm6dsr_sh_data_rate_get(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_shub_odr_t *val);

