dwynnychuk/SmartSmoker/ESP32Code/lib/LSM6DS/lsm6dsr_reg.h
typedef struct{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsr_sh_cfg_write_t;
int32_t lsm6dsr_sh_cfg_write(lsm6dsr_ctx_t *ctx,
                             lsm6dsr_sh_cfg_write_t *val);

typedef struct{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsr_sh_cfg_read_t;
int32_t lsm6dsr_sh_slv0_cfg_read(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv1_cfg_read(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv2_cfg_read(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv3_cfg_read(lsm6dsr_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);

int32_t lsm6dsr_sh_status_get(lsm6dsr_ctx_t *ctx,
                              lsm6dsr_status_master_t *val);

typedef enum {
  LSM6DSR_S4S_TPH_7bit   = 0,
  LSM6DSR_S4S_TPH_15bit  = 1,
} lsm6dsr_s4s_tph_res_t;
int32_t lsm6dsr_s4s_tph_res_set(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_s4s_tph_res_t val);
int32_t lsm6dsr_s4s_tph_res_get(lsm6dsr_ctx_t *ctx,
                                lsm6dsr_s4s_tph_res_t *val);

int32_t lsm6dsr_s4s_tph_val_set(lsm6dsr_ctx_t *ctx, uint16_t val);
int32_t lsm6dsr_s4s_tph_val_get(lsm6dsr_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DSR_S4S_DT_RES_11 = 0,
  LSM6DSR_S4S_DT_RES_12 = 1,
  LSM6DSR_S4S_DT_RES_13 = 2,
  LSM6DSR_S4S_DT_RES_14 = 3,
} lsm6dsr_s4s_res_ratio_t;
int32_t lsm6dsr_s4s_res_ratio_set(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_s4s_res_ratio_t val);
int32_t lsm6dsr_s4s_res_ratio_get(lsm6dsr_ctx_t *ctx,
                                  lsm6dsr_s4s_res_ratio_t *val);

int32_t lsm6dsr_s4s_command_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_s4s_command_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_s4s_dt_set(lsm6dsr_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_s4s_dt_get(lsm6dsr_ctx_t *ctx, uint8_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DSR_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
